/**
******************************************************************************
  * @file       time.h
  * @brief      简单计时函数头文件
  * @version    1.3
  * @date       Tue 06-08-2019
  * @update		由于系统心跳生成，注释掉滴答定时
******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __TIME_H
#define __TIME_H

#ifdef __cplusplus
extern "C"
{
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
void Delay(u32 t);
//void delay_ms(u32 xms);
//void delay_us(u32 xus);

#ifdef __cplusplus
}
#endif

#endif
